SmartTech/nRF52840-Vega/nRF52/core/libraries/nRF52_FIFO.c
#include "nRF52_FIFO.h"
#include "sdk_common.h"

/* ============================================================================
 * @brief     Получение размерности буфера FIFO
 * ------------------------------------------------------------------------- */
uint32_t nrf52_fifo_length(nrf52_fifo_t * p_fifo)
{
    uint32_t tmp = p_fifo->read_pos;
    return p_fifo->write_pos - tmp;
}

/* ============================================================================
 * @brief     Запись одного байта в буфер FIFO
 * ------------------------------------------------------------------------- */
void fifo_put(nrf52_fifo_t * p_fifo, uint8_t byte)
{
    p_fifo->p_buf[p_fifo->write_pos & p_fifo->buf_size_mask] = byte;
    p_fifo->write_pos++;
}

/* ============================================================================
 * @brief     Просмотр одного байта из буфера FIFO
 * ------------------------------------------------------------------------- */
void fifo_peek(nrf52_fifo_t * p_fifo, uint16_t index, uint8_t * p_byte)
{
    *p_byte = p_fifo->p_buf[(p_fifo->read_pos + index) & p_fifo->buf_size_mask];
}

/* ============================================================================
 * @brief     Получение одного байта из буфера FIFO
 * ------------------------------------------------------------------------- */
void fifo_get(nrf52_fifo_t * p_fifo, uint8_t * p_byte)
{
    fifo_peek(p_fifo, 0, p_byte);
    p_fifo->read_pos++;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_init(nrf52_fifo_t * p_fifo, uint8_t * p_buf, uint16_t buf_size)
{
    // Check buffer for null pointer.
    if (p_buf == NULL)
    {
        return NRF_ERROR_NULL;
    }

    // Check that the buffer size is a power of two.
    if (!IS_POWER_OF_TWO(buf_size))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    p_fifo->p_buf         = p_buf;
    p_fifo->buf_size_mask = buf_size - 1;
    p_fifo->read_pos      = 0;
    p_fifo->write_pos     = 0;

    return NRF_SUCCESS;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_put(nrf52_fifo_t * p_fifo, uint8_t byte)
{
    if (FIFO_LENGTH <= p_fifo->buf_size_mask)
    {
        fifo_put(p_fifo, byte);
        return NRF_SUCCESS;
    }

    return NRF_ERROR_NO_MEM;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_get(nrf52_fifo_t * p_fifo, uint8_t * p_byte)
{
    if (FIFO_LENGTH != 0)
    {
        fifo_get(p_fifo, p_byte);
        return NRF_SUCCESS;
    }

    return NRF_ERROR_NOT_FOUND;

}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_peek(nrf52_fifo_t * p_fifo, uint16_t index, uint8_t * p_byte)
{
    if (FIFO_LENGTH > index) {
        fifo_peek(p_fifo, index, p_byte);
        return NRF_SUCCESS;
    }
    return NRF_ERROR_NOT_FOUND;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_flush(nrf52_fifo_t * p_fifo)
{
    p_fifo->read_pos = p_fifo->write_pos;
    return NRF_SUCCESS;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_read(nrf52_fifo_t * p_fifo, uint8_t * p_byte_array, uint32_t * p_size)
{
    VERIFY_PARAM_NOT_NULL(p_fifo);
    VERIFY_PARAM_NOT_NULL(p_size);

    const uint32_t byte_count    = nrf52_fifo_length(p_fifo);
    const uint32_t requested_len = (*p_size);
    uint32_t       index         = 0;
    uint32_t       read_size     = MIN(requested_len, byte_count);

    (*p_size) = byte_count;

    // Проверка на наличие данных
    if (byte_count == 0)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    // Check if application has requested only the size.
    if (p_byte_array == NULL)
    {
        return NRF_SUCCESS;
    }

    // Получение данных из буфера
    while (index < read_size)
    {
        fifo_get(p_fifo, &p_byte_array[index++]);
    }

    (*p_size) = read_size;

    return NRF_SUCCESS;
}

//-----------------------------------------------------------------------------

uint32_t nrf52_fifo_write(nrf52_fifo_t * p_fifo, uint8_t const * p_byte_array, uint32_t * p_size)
{
    VERIFY_PARAM_NOT_NULL(p_fifo);
    VERIFY_PARAM_NOT_NULL(p_size);

    const uint32_t available_count = p_fifo->buf_size_mask - nrf52_fifo_length(p_fifo) + 1;
    const uint32_t requested_len   = (*p_size);
    uint32_t       index           = 0;
    uint32_t       write_size      = MIN(requested_len, available_count);

    (*p_size) = available_count;

    // Проверка на свободное место в буфере
    if (available_count == 0)
    {
        return NRF_ERROR_NO_MEM;
    }

    // Check if application has requested only the size.
    if (p_byte_array == NULL)
    {
        return NRF_SUCCESS;
    }

    // Получаем данные из буфера FIFO.
    while (index < write_size)
    {
        fifo_put(p_fifo, p_byte_array[index++]);
    }

    (*p_size) = write_size;

    return NRF_SUCCESS;
}

//-----------------------------------------------------------------------------
